MikroElektronika/core_packages/PIC/XC8/def/PIC16C773/mcu.h
extern volatile TXSTAbits_t TXSTAbits __at(0x098);
// bitfield macros
#define _TXSTA_TX9D_POSN                                    0x0
#define _TXSTA_TX9D_POSITION                                0x0
#define _TXSTA_TX9D_SIZE                                    0x1
#define _TXSTA_TX9D_LENGTH                                  0x1
#define _TXSTA_TX9D_MASK                                    0x1
#define _TXSTA_TRMT_POSN                                    0x1
#define _TXSTA_TRMT_POSITION                                0x1
#define _TXSTA_TRMT_SIZE                                    0x1
#define _TXSTA_TRMT_LENGTH                                  0x1
#define _TXSTA_TRMT_MASK                                    0x2
#define _TXSTA_BRGH_POSN                                    0x2
#define _TXSTA_BRGH_POSITION                                0x2
#define _TXSTA_BRGH_SIZE                                    0x1
#define _TXSTA_BRGH_LENGTH                                  0x1
#define _TXSTA_BRGH_MASK                                    0x4
#define _TXSTA_SYNC_POSN                                    0x4
#define _TXSTA_SYNC_POSITION                                0x4
#define _TXSTA_SYNC_SIZE                                    0x1
#define _TXSTA_SYNC_LENGTH                                  0x1
#define _TXSTA_SYNC_MASK                                    0x10
#define _TXSTA_TXEN_POSN                                    0x5
#define _TXSTA_TXEN_POSITION                                0x5
#define _TXSTA_TXEN_SIZE                                    0x1
#define _TXSTA_TXEN_LENGTH                                  0x1
#define _TXSTA_TXEN_MASK                                    0x20
#define _TXSTA_TX9_POSN                                     0x6
#define _TXSTA_TX9_POSITION                                 0x6
#define _TXSTA_TX9_SIZE                                     0x1
#define _TXSTA_TX9_LENGTH                                   0x1
#define _TXSTA_TX9_MASK                                     0x40
#define _TXSTA_CSRC_POSN                                    0x7
#define _TXSTA_CSRC_POSITION                                0x7
#define _TXSTA_CSRC_SIZE                                    0x1
#define _TXSTA_CSRC_LENGTH                                  0x1
#define _TXSTA_CSRC_MASK                                    0x80
#define _TXSTA_TXD8_POSN                                    0x0
#define _TXSTA_TXD8_POSITION                                0x0
#define _TXSTA_TXD8_SIZE                                    0x1
#define _TXSTA_TXD8_LENGTH                                  0x1
#define _TXSTA_TXD8_MASK                                    0x1
#define _TXSTA_nTX8_POSN                                    0x6
#define _TXSTA_nTX8_POSITION                                0x6
#define _TXSTA_nTX8_SIZE                                    0x1
#define _TXSTA_nTX8_LENGTH                                  0x1
#define _TXSTA_nTX8_MASK                                    0x40
#define _TXSTA_TX8_9_POSN                                   0x6
#define _TXSTA_TX8_9_POSITION                               0x6
#define _TXSTA_TX8_9_SIZE                                   0x1
#define _TXSTA_TX8_9_LENGTH                                 0x1
#define _TXSTA_TX8_9_MASK                                   0x40

// Register: SPBRG
#define SPBRG SPBRG
extern volatile unsigned char           SPBRG               __at(0x099);
#ifndef _LIB_BUILD
asm("SPBRG equ 099h");
#endif

// Register: REFCON
#define REFCON REFCON
extern volatile unsigned char           REFCON              __at(0x09B);
#ifndef _LIB_BUILD
asm("REFCON equ 09Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned VRLOEN                 :1;
        unsigned VRHOEN                 :1;
        unsigned VRLEN                  :1;
        unsigned VRHEN                  :1;
    };
} REFCONbits_t;
extern volatile REFCONbits_t REFCONbits __at(0x09B);
// bitfield macros
#define _REFCON_VRLOEN_POSN                                 0x4
#define _REFCON_VRLOEN_POSITION                             0x4
#define _REFCON_VRLOEN_SIZE                                 0x1
#define _REFCON_VRLOEN_LENGTH                               0x1
#define _REFCON_VRLOEN_MASK                                 0x10
#define _REFCON_VRHOEN_POSN                                 0x5
#define _REFCON_VRHOEN_POSITION                             0x5
#define _REFCON_VRHOEN_SIZE                                 0x1
#define _REFCON_VRHOEN_LENGTH                               0x1
#define _REFCON_VRHOEN_MASK                                 0x20
#define _REFCON_VRLEN_POSN                                  0x6
#define _REFCON_VRLEN_POSITION                              0x6
#define _REFCON_VRLEN_SIZE                                  0x1
#define _REFCON_VRLEN_LENGTH                                0x1
#define _REFCON_VRLEN_MASK                                  0x40
#define _REFCON_VRHEN_POSN                                  0x7
#define _REFCON_VRHEN_POSITION                              0x7
#define _REFCON_VRHEN_SIZE                                  0x1
#define _REFCON_VRHEN_LENGTH                                0x1
#define _REFCON_VRHEN_MASK                                  0x80

// Register: LVDCON
#define LVDCON LVDCON
extern volatile unsigned char           LVDCON              __at(0x09C);
#ifndef _LIB_BUILD
asm("LVDCON equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LV                     :4;
        unsigned LVDEN                  :1;
        unsigned BGST                   :1;
    };
    struct {
        unsigned LV0                    :1;
        unsigned LV1                    :1;
        unsigned LV2                    :1;
        unsigned LV3                    :1;
    };
} LVDCONbits_t;
extern volatile LVDCONbits_t LVDCONbits __at(0x09C);
// bitfield macros
#define _LVDCON_LV_POSN                                     0x0
#define _LVDCON_LV_POSITION                                 0x0
#define _LVDCON_LV_SIZE                                     0x4
#define _LVDCON_LV_LENGTH                                   0x4
#define _LVDCON_LV_MASK                                     0xF
#define _LVDCON_LVDEN_POSN                                  0x4
#define _LVDCON_LVDEN_POSITION                              0x4
#define _LVDCON_LVDEN_SIZE                                  0x1
#define _LVDCON_LVDEN_LENGTH                                0x1
#define _LVDCON_LVDEN_MASK                                  0x10
#define _LVDCON_BGST_POSN                                   0x5
#define _LVDCON_BGST_POSITION                               0x5
#define _LVDCON_BGST_SIZE                                   0x1
#define _LVDCON_BGST_LENGTH                                 0x1
#define _LVDCON_BGST_MASK                                   0x20
#define _LVDCON_LV0_POSN                                    0x0
#define _LVDCON_LV0_POSITION                                0x0
#define _LVDCON_LV0_SIZE                                    0x1
#define _LVDCON_LV0_LENGTH                                  0x1
#define _LVDCON_LV0_MASK                                    0x1
#define _LVDCON_LV1_POSN                                    0x1
#define _LVDCON_LV1_POSITION                                0x1
#define _LVDCON_LV1_SIZE                                    0x1
#define _LVDCON_LV1_LENGTH                                  0x1
#define _LVDCON_LV1_MASK                                    0x2
#define _LVDCON_LV2_POSN                                    0x2
#define _LVDCON_LV2_POSITION                                0x2
#define _LVDCON_LV2_SIZE                                    0x1
#define _LVDCON_LV2_LENGTH                                  0x1
#define _LVDCON_LV2_MASK                                    0x4
#define _LVDCON_LV3_POSN                                    0x3
#define _LVDCON_LV3_POSITION                                0x3
#define _LVDCON_LV3_SIZE                                    0x1
#define _LVDCON_LV3_LENGTH                                  0x1
#define _LVDCON_LV3_MASK                                    0x8

// Register: ADRESL
#define ADRESL ADRESL
extern volatile unsigned char           ADRESL              __at(0x09E);
#ifndef _LIB_BUILD
asm("ADRESL equ 09Eh");
#endif

// Register: ADCON1
#define ADCON1 ADCON1
extern volatile unsigned char           ADCON1              __at(0x09F);
#ifndef _LIB_BUILD
asm("ADCON1 equ 09Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCFG                   :4;
        unsigned VCFG                   :3;
        unsigned ADFM                   :1;
    };
    struct {
        unsigned PCFG0                  :1;
        unsigned PCFG1                  :1;
        unsigned PCFG2                  :1;
        unsigned PCFG3                  :1;
        unsigned VCFG0                  :1;
        unsigned VCFG1                  :1;
        unsigned VCFG2                  :1;
    };
} ADCON1bits_t;
